#+TITLE: October 10-23, 2018
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO                                       | NEXT | IN_PROGRESS                                     | WAITING | DONE                                                         | CANCELED |
|--------------------------------------------+------+-------------------------------------------------+---------+--------------------------------------------------------------+----------|
| DEV.1539319867. Python Tutorials - Part II |      | READ.1539319760. Computer Network by Kruose & R |         | DEV.1539622626. Learning Golang Chapter 7 Exer (2018-10-23)  |          |
|                                            |      | DEV.1539319809. [[https://docs.djangoproject.c  |         | DEV.1539622282. Learning Golang Chapter 6 Exer (2018-10-21)  |          |
|                                            |      |                                                 |         | READ.1539622386. Learning Golang Chapter 7. Int (2018-10-21) |          |
|                                            |      |                                                 |         | READ.1538996950. [#A] Linux for you and me (2018-10-13)      |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME        | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|-------------+-----------+--------+------+-----------+--------------+------------|
| Bhavin192   |      6.99 |   6.57 | 6.99 |         0 |   2018-10-29 | ########## |
| Homuncculus |      28.0 |    5.5 |    0 |      28.0 |   2018-11-16 | ---------- |
| Sidntrivedi |         1 |   0.42 |    1 |         0 |   2018-10-29 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  40 +---------------------------------------------------------------------+   
:     |                                                                     |   
:  35 |+   #####################################################UAL #######+|   
:     |    .....                                              IDEAL ....... |   
:  30 |+        .....                                                      +|   
:     |              .....                                        ##########|   
:     |                   ....                                              |   
:  25 |+                      .                                            +|   
:     |                        .....                                        |   
:  20 |+                            .....                                  +|   
:     |                                  .....                              |   
:  15 |+                                      .....                        +|   
:     |                                            .....                    |   
:  10 |+                                                .....              +|   
:     |                                                      ....           |   
:     |                                                          .          |   
:   5 |+                                                          .....    +|   
:     |                                                                .....|   
:   0 +---------------------------------------------------------------------+   
:     0         2         4         6         8         10        12        14  
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:14]"
#+BEGIN: block-update-burndown
| DAY |       DATE |             ACTUAL | IDEAL | TASKS COMPLETED                |
|-----+------------+--------------------+-------+--------------------------------|
|   1 | 2018-10-10 | 35.989999999999995 |    33 |                                |
|   2 | 2018-10-11 | 35.989999999999995 |    31 |                                |
|   3 | 2018-10-12 | 35.989999999999995 |    28 |                                |
|   4 | 2018-10-13 | 34.989999999999995 |    26 | READ.1538996950                |
|   5 | 2018-10-14 | 34.989999999999995 |    23 |                                |
|   6 | 2018-10-15 | 34.989999999999995 |    21 |                                |
|   7 | 2018-10-16 | 34.989999999999995 |    18 |                                |
|   8 | 2018-10-17 | 34.989999999999995 |    15 |                                |
|   9 | 2018-10-18 | 34.989999999999995 |    13 |                                |
|  10 | 2018-10-19 | 34.989999999999995 |    10 |                                |
|  11 | 2018-10-20 | 34.989999999999995 |     8 |                                |
|  12 | 2018-10-21 | 29.159999999999997 |     5 | READ.1539622386 DEV.1539622282 |
|  13 | 2018-10-22 | 29.159999999999997 |     3 |                                |
|  14 | 2018-10-23 | 27.999999999999996 |     0 | DEV.1539622626                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                        | TASKID          | OWNER          | PRIORITY | TODO        |          ESTIMATED |             ACTUAL |
|---------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------------------|
| TASKS                                       |                 |                | B        |             | 35.989999999999995 | 12.489999999999998 |
|---------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------------------|
| Linux for you and me                        | READ.1538996950 | sidntrivedi012 | A        | DONE        |                  1 |               0.42 |
|---------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------------------|
| Computer Network by Kruose & Ross - Part II | READ.1539319760 | homuncculus    | B        | IN_PROGRESS |               14.0 |               4.78 |
|---------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------------------|
| [[https://docs.djangoproject.com/en/2.1/intro/][Django Project]]                              | DEV.1539319809  | homuncculus    | B        | IN_PROGRESS |               10.0 |               0.22 |
|---------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------------------|
| Python Tutorials - Part II                  | DEV.1539319867  | homuncculus    | B        | TODO        |                4.0 |               0.50 |
|---------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------------------|
| Learning Golang Chapter 6 Exercises         | DEV.1539622282  | bhavin192      | B        | DONE        |               5.33 |               5.30 |
|---------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------------------|
| Learning Golang Chapter 7. Interfaces       | READ.1539622386 | bhavin192      | B        | DONE        |                0.5 |               0.62 |
|---------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------------------|
| Learning Golang Chapter 7 Exercises         | DEV.1539622626  | bhavin192      | B        | DONE        |               1.16 |               0.65 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 14
  :SPRINTSTART: <2018-10-10 Wed>
  :wpd-sidntrivedi:      1
  :wpd-homuncculus:      2
  :wpd-bhavin192:        0.5
  :END:
** DONE [#A] Linux for you and me [1/1]
   CLOSED: [2018-10-13 Sat 12:00]
  :PROPERTIES:
  :ESTIMATED: 1
  :ACTUAL:   0.42
  :OWNER: sidntrivedi012
  :ID: READ.1538996950
  :TASKID: READ.1538996950
  :END:      
  :LOGBOOK:
   CLOCK: [2018-10-13 Sat 07:34]--[2018-10-13 Sat 07:46] =>  0:12
   CLOCK: [2018-10-13 Sat 07:03]--[2018-10-13 Sat 07:03] =>  0:00
   CLOCK: [2018-10-12 Fri 20:29]--[2018-10-12 Fri 20:42] =>  0:13
  :END:      
  - [X] Shell Commands		(1 hr)
** IN_PROGRESS Computer Network by Kruose & Ross - Part II [1/4]       :read:
   :PROPERTIES:
   :ESTIMATED: 14.0
   :ACTUAL:   4.78
   :OWNER:    homuncculus
   :ID: READ.1539319760
   :TASKID: READ.1539319760
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-18 Thu 11:25]--[2018-10-18 Thu 11:50] =>  0:25
   CLOCK: [2018-10-18 Thu 10:51]--[2018-10-18 Thu 11:25] =>  0:34
   CLOCK: [2018-10-18 Thu 05:19]--[2018-10-18 Thu 05:44] =>  0:25
   CLOCK: [2018-10-18 Thu 04:44]--[2018-10-18 Thu 05:09] =>  0:25
   CLOCK: [2018-10-16 Tue 04:37]--[2018-10-16 Tue 05:52] =>  1:15
   CLOCK: [2018-10-15 Mon 17:55]--[2018-10-15 Mon 19:38] =>  1:43
   :END:
   - [X] Chapter 3. Transport Layer (TCP/IP Protocol Suit by Forouzan) (4h)
   - [ ] Practice Problems (3h)
   - [ ] Chapter 4. Network Layer (4h)
   - [ ] Practice Problems (3h)
** IN_PROGRESS [[https://docs.djangoproject.com/en/2.1/intro/][Django Project]] [0%]
   :PROPERTIES:
   :ESTIMATED: 10.0
   :ACTUAL:   0.22
   :OWNER: homuncculus
   :ID: DEV.1539319809
   :TASKID: DEV.1539319809
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-13 Sat 14:52]--[2018-10-13 Sat 15:05] =>  0:13
   :END:
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial01/][Poll App, Part 1]] (30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial02/][Poll App, Part 2]] (1h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial03/][Poll App, Part 3]] (1h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial04/][Poll App, Part 4]] (1h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial05/][Poll App, Part 5]] (2h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial06/][Poll App, Part 6]] (30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial07/][Poll App, Part 7]] (2h)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/reusable-apps/][Reusable Apps]] (30m)
** TODO Python Tutorials - Part II [0/3]
   :PROPERTIES:
   :ESTIMATED: 4.0
   :ACTUAL:   0.50
   :OWNER:    homuncculus
   :ID: DEV.1539319867
   :TASKID: DEV.1539319867
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-12 Fri 12:00]--[2018-10-12 Fri 12:30] =>  0:30
   :END:
   - [ ] [[https://docs.python.org/3/tutorial/stdlib.html][Brief tour of standard library - I]] (1h)
   - [ ] [[https://docs.python.org/3/tutorial/stdlib2.html][Brief tour of standard library - II]] (2h)
   - [ ] [[https://docs.python.org/3/tutorial/venv.html][Virtual environments & packages]] (45m)
** DONE Learning Golang Chapter 6 Exercises [5/5]
   CLOSED: [2018-10-21 Sun 20:10]
   :PROPERTIES:
   :ESTIMATED: 5.33
   :ACTUAL:   5.30
   :OWNER: bhavin192
   :ID: DEV.1539622282
   :TASKID: DEV.1539622282
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-21 Sun 19:53]--[2018-10-21 Sun 20:10] =>  0:17
   CLOCK: [2018-10-21 Sun 18:41]--[2018-10-21 Sun 18:54] =>  0:13
   CLOCK: [2018-10-21 Sun 17:44]--[2018-10-21 Sun 18:36] =>  0:52
   CLOCK: [2018-10-17 Wed 22:39]--[2018-10-17 Wed 23:04] =>  0:25
   CLOCK: [2018-10-16 Tue 22:08]--[2018-10-16 Tue 22:42] =>  0:34
   CLOCK: [2018-10-15 Mon 23:01]--[2018-10-15 Mon 23:33] =>  0:32
   CLOCK: [2018-10-14 Sun 18:30]--[2018-10-14 Sun 18:56] =>  0:26
   CLOCK: [2018-10-14 Sun 18:18]--[2018-10-14 Sun 18:28] =>  0:10
   CLOCK: [2018-10-14 Sun 17:54]--[2018-10-14 Sun 18:17] =>  0:23
   CLOCK: [2018-10-14 Sun 17:23]--[2018-10-14 Sun 17:40] =>  0:17
   CLOCK: [2018-10-12 Fri 22:57]--[2018-10-12 Fri 23:35] =>  0:38
   CLOCK: [2018-10-10 Wed 22:59]--[2018-10-10 Wed 23:30] =>  0:31
   :END:
   - [X] 6.1 (90m)
   - [X] 6.2 (20m)
   - [X] 6.3 (150m)
   - [X] 6.4 (30m)
   - [X] 6.5 (30m)
** DONE Learning Golang Chapter 7. Interfaces [1/1]
   CLOSED: [2018-10-21 Sun 22:33]
   :PROPERTIES:
   :ESTIMATED: 0.5
   :ACTUAL:   0.62
   :OWNER: bhavin192
   :ID: READ.1539622386
   :TASKID: READ.1539622386
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-21 Sun 21:56]--[2018-10-21 Sun 22:33] =>  0:37
   :END:
   - [X] 7.1 Interfaces as Contracts (30m)
** DONE Learning Golang Chapter 7 Exercises [1/1]
   CLOSED: [2018-10-23 Tue 19:50]
   :PROPERTIES:
   :ESTIMATED: 1.16
   :ACTUAL:   0.65
   :OWNER: bhavin192
   :ID: DEV.1539622626
   :TASKID: DEV.1539622626
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-23 Tue 19:42]--[2018-10-23 Tue 19:50] =>  0:08
   CLOCK: [2018-10-22 Mon 21:06]--[2018-10-22 Mon 21:16] =>  0:10
   CLOCK: [2018-10-22 Mon 19:40]--[2018-10-22 Mon 20:01] =>  0:21
   :END:
   - [X] 7.1 Part I (70m)
